import os, sys, requests, re, random, time
import datetime
import getpass
from os import system as psl
from bs4 import BeautifulSoup as sop
from concurrent.futures import ThreadPoolExecutor as bsn

url = 'https://m.facebook.com/login.php'

def clear():
    if os.name == 'nt':
        os.system('cls')
    else:
        os.system('clear')

def sp(stri):
    for letter in stri:
        print(letter, end = "")
        sys.stdout.flush()
os.system('clear')


psl('rm -rf filer.txt')
idd = []

def logo():
    print("\033[1;37m⌌\033[1;31m━━━━\033[1;32m━━━━\033[1;33m━━━━\033[1;34m━━━━\033[1;35m━━━━\033[1;36m━━━━\033[1;37m━━━━\033[1;30m━━━━\033[1;31m━━━\033[1;32m━━━━\033[1;33m━━━━━\033[1;37m⌍")
    print("\033[0;92m▏                                             ▏")
    print("\033[1;31m▏.███╗   ██╗ █████╗ ███████╗██╗██████╗        ▏")
    print("\033[1;32m▏.████╗  ██║██╔══██╗██╔════╝██║██╔══██╗       ▏")
    print("\033[1;33m▏.██╔██╗ ██║███████║███████╗██║██████╔╝       ▏")
    print("\033[1;34m▏.██║╚██╗██║██╔══██║╚════██║██║██╔══██╗       ▏")    
    print("\033[1;35m▏.██║ ╚████║██║  ██║███████║██║██║  ██║       ▏")
    print("\033[1;36m▏.╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝╚═╝╚═╝  ╚═╝       ▏")
    print("\033[0;92m▏                                             ▏")
    print("\033[1;37m⌎\033[1;31m━━━━\033[1;32m━━━━\033[1;33m━━━━\033[1;34m━━━━\033[1;35m━━━━\033[1;36m━━━━\033[1;37m━━━━\033[1;30m━━━━\033[1;31m━━━\033[1;32m━━━━\033[1;33m━━━━━\033[1;37m⌏")
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    print("\033[0;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
    print("\033[1;39m━▷ \033[0;91m𝙊𝙒𝙉𝙀𝙍    \033[1;39m◈✙◈\033[1;33m MR NASIR")
    print("\033[1;39m━▷ \033[0;91m𝙏𝙀𝘼𝙈     \033[1;39m◈✙◈\033[1;30m D3VIL\033[1;37m◆\033[1;30mMUSK9N\033[1;37m◆\033[1;30mCH9ND\033[1;37m◆\033[1;30mNOMIIW\033[1;37m◆")
    print("\033[1;39m━▷ \033[0;91m𝙔𝙊𝙐𝙏𝙐𝘽𝙀  \033[1;39m◈✙◈ \033[1;32mN9SIIR TRICKER")
    print("\033[1;39m━▷ \033[0;91m𝙁𝘼𝘾𝙀𝘽𝙊𝙊𝙆 \033[1;39m◈✙◈ \033[1;33mhttps://www.facebook.com/LEGEND.NASIR.MUSKAN.ON.FIRE")
    print("\033[1;39m━▷ \033[0;91m𝙁𝘽 𝙂𝙍𝙊𝙐𝙋 \033[1;39m◈✙◈ \033[1;34mALL TRICKS ZONE ")
    print("\033[1;39m━▷ \033[0;91m𝙎𝘼𝙏𝙐𝙏𝘼𝙎  \033[1;39m◈✙◈ \033[0;92mFREE AND ENJOY")
    print("\033[1;39m━▷ \033[0;91m𝙏𝙊𝙊𝙇     \033[1;39m◈✙◈\033[1;31m COOKI3 C0NV3R SING9L ID ")
    print("\033[1;39m━▷ \033[0;91m𝙑𝙀𝙍𝙎𝙄𝙊𝙉  \033[1;39m◈✙◈ \033[1;37m1.0")
    print("\033[1;39m━▷ \033[1;36m𝙁𝙀𝙀𝙇 𝙏𝙃𝙀 𝙋𝙊𝙒𝙀𝙍 𝙊𝙁 𝙉𝘼𝙎𝙄𝙄𝙍 𝙏𝙍𝙄𝘾𝙆𝙀𝙍")
os.system('clear')
logo2 ="""\033[1;30m
                  ▉▉▉▉
                 ▂▉▉▉▉▂
                \033[1;33m╰▏ ┛┗ ▕╯
                 ╲ 👅 ╱
                 \033[1;32m╱▔╲╱▔╲
               ╱ ╱▏╭╮▕╲ ╲        \033[1;37m⌌\033[1;34m━━━━\033[1;35m━━━\033[1;36m━━━━\033[1;37m━━━━\033[1;36m━━━\033[1;31m━━━\033[1;37m⌍              
               ╲ ╲▏╭╮▕╱ ╱        \033[1;31m▏\033[1;31m   N9SIIR X MUSK9N    ▏ 
                \033[1;35m ╲▉▉▉▉╱          \033[1;32m▏\033[1;34m   CH9ND X CH9NDNI    ▏ 
                \033[1;34m  ▏╭╮▕           \033[1;33m▏\033[1;32m   D3VIIL X K9MLII    ▏ 
                \033[1;34m  ▏▏▕▕           \033[1;37m⌎\033[1;31m━━━\033[1;36m━━━━\033[1;32m━━━\033[1;37m━━━━\033[1;33m━━━\033[1;34m━━━━\033[1;37m⌏
                  ▏▏▕▕
                \033[1;31m ╭╰ ╮╭╰ ╮
               \033[1;39msᴜʙ \033[1;35mᴋᴀ \033[1;36mʙᴀᴀᴘ
\033[1;37m⌌\033[1;31m━━━━\033[1;32m━━━━\033[1;33m━━━━\033[1;34m━━━━\033[1;35m━━━━\033[1;36m━━━━\033[1;37m━━━━\033[1;30m━━━━\033[1;31m━━━\033[1;32m━━━━\033[1;33m━━━━━\033[1;37m⌍
\033[0;92m▏                                             ▏
\033[1;31m▏.███╗   ██╗ █████╗ ███████╗██╗██████╗        ▏
\033[1;32m▏.████╗  ██║██╔══██╗██╔════╝██║██╔══██╗       ▏
\033[1;33m▏.██╔██╗ ██║███████║███████╗██║██████╔╝       ▏
\033[1;34m▏.██║╚██╗██║██╔══██║╚════██║██║██╔══██╗       ▏
\033[1;35m▏.██║ ╚████║██║  ██║███████║██║██║  ██║       ▏
\033[1;36m▏.╚═╝  ╚═══╝╚═╝  ╚═╝╚══════╝╚═╝╚═╝  ╚═╝       ▏
\033[0;92m▏                                             ▏
\033[1;37m⌎\033[1;31m━━━━\033[1;32m━━━━\033[1;33m━━━━\033[1;34m━━━━\033[1;35m━━━━\033[1;36m━━━━\033[1;37m━━━━\033[1;30m━━━━\033[1;31m━━━\033[1;32m━━━━\033[1;33m━━━━━\033[1;37m⌏
\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙
\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●
\033[1;39m━▷ \033[0;91m𝙊𝙒𝙉𝙀𝙍    \033[1;39m◈✙◈\033[1;33m MR NASIR
\033[1;39m━▷ \033[0;91m𝙏𝙀𝘼𝙈     \033[1;39m◈✙◈\033[1;30m D3VIL\033[1;37m◆\033[1;30mMUSK9N\033[1;37m◆\033[1;30mCH9ND\033[1;37m◆\033[1;30mNOMIIW\033[1;37m◆
\033[1;39m━▷ \033[0;91m𝙔𝙊𝙐𝙏𝙐𝘽𝙀  \033[1;39m◈✙◈ \033[1;32mN9SIIR TRICKER
\033[1;39m━▷ \033[0;91m𝙁𝘼𝘾𝙀𝘽𝙊𝙊𝙆 \033[1;39m◈✙◈ \033[1;33mhttps://www.facebook.com/LEGEND.NASIR.MUSKAN.ON.FIRE
\033[1;39m━▷ \033[0;91m𝙁𝘽 𝙂𝙍𝙊𝙐𝙋 \033[1;39m◈✙◈ \033[1;34mALL TRICKS ZONE 
\033[1;39m━▷ \033[0;91m𝙎𝘼𝙏𝙐𝙏𝘼𝙎  \033[1;39m◈✙◈ \033[0;92mFREE AND ENJOY
\033[1;39m━▷ \033[0;91m𝙏𝙊𝙊𝙇     \033[1;39m◈✙◈\033[1;31m 
\033[1;39m━▷ \033[0;91m𝙑𝙀𝙍𝙎𝙄𝙊𝙉  \033[1;39m◈✙◈ \033[1;37m1.0
\033[1;39m━▷ \033[1;36m𝙁𝙀𝙀𝙇 𝙏𝙃𝙀 𝙋𝙊𝙒𝙀𝙍 𝙊𝙁 𝙉𝘼𝙎𝙄𝙄𝙍 𝙏𝙍𝙄𝘾𝙆𝙀𝙍
\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●
\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙"""
def approval():
  os.system('git pull')
  uuid = str(os.geteuid())+"DS"+str(os.geteuid())
  id = "N9SIIR-TRICKER-"+"".join(uuid)
  os.system('clear')
  logo()
  sp("\033[1;39m━▷ You Get Approved for Using Command  Paid Tool 200 Per month \033[1;37m")
  print("\n\033[1;39m━▷ Your Key :\u001b[36m "+id)
  print ("""\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑◑\033[1;33m◑\033[1;34m◑\033[1;35m◑""")

  try:
    httpCaht = requests.get('https://github.com/Abdullwh1/Approvel/blob/main/Approvel').text
    if id in httpCaht:
      sp("\n\033[1;39m━▷ Congrats You get approved successful And Enjoy")
      msg = str(os.geteuid())     
      pass
    else: 
      sp("\n\033[1;39m━▷ Your Key Not approved please  Say to Admin");    
      input('\n\nWHEN YOU BUY TOOL THEN ENTER PRESS')
      tks = ('Hello%20Sir%20!%20Please%20Approved%20My%20Token%20The%20Token%20Is%20:%20'+id);os.system('am start https://wa.me/+923114295092?text='+tks),approval()
      time.sleep(2)
      exit()
  except Exception as e:
     print(e)
     sp(" >> Unable Data From Server ")
     time.sleep(2)
     approval()
  except:
    sys.exit()
    
approval()

os.system('clear')

print(logo2)
attemps = 0

while attemps < 12345677901:

    sp("\033[1m\033[36m[+] Login Approveal UesrName \n")
    print("\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
    username = input('\n\n\033[1;31;40mEnter username: ')
    print("\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
    sp("\033[1m\033[36m[+] Login Approveal Password \n")
    print("\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[1;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
    password = input('\033[1;32mEnter password: ')
    
    if username == 'P9KIST9N' and password == 'ZIND9B9D':
    	
        print('You have successfully logged in.')
        
        break

    else:

        print('Incorrect Password ')
        
        attemps += 1
        
        continue
 
psl('rm -rf filer.txt')
idd = []

def main():
    psl('clear')
    logo()
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    print('\x1b[1;94m  Put >>\x1b[1;96m  Cookie\x1b[1;95m Delay\x1b[1;97m Chat/Inbox Link id\x1b[1;93m File Repeat\x1b[1;92m Hater Name\x1b[1;91m File ')
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    print('\033[1;39m╭\033[1;30m────\033[1;31m────\033[1;32m────\033[1;33m────\033[1;34m────\033[1;35m────\033[1;36m─────\033[1;37m─────\033[1;31m─────\033[1;32m────\033[1;35m➛\033[1;37m➢')
    coki = input("╰\033[1;33m───\033[1;35m➛ \033[1;34m Cookies :\033[1;32m")
    cookies={'cookie': coki}
    ch = requests.get('https://mbasic.facebook.com/', cookies=cookies)
    if 'mbasic_logout_button' in ch.text:
        pass
    else:
        print(' \x1b[1;91mYour Account is on Checkpoint !!! \x1b[1;97m')
        os.sys.exit()
    print(' \x1b[1;92m Account Logged in Successfully\x1b[1;97m ')
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    delay = int(input(' [+] Delay : '))
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    lnk = input(' [+] Chat/Inbox Link id : ')
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    lim = int(input(' [+] File Repeat : '))
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    hater = input(' [+] Haters Name : ')
    print("\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;30m❙\033[1;37m◆\033[1;31m❙\033[1;37m◆\033[1;32m❙\033[1;37m◆\033[1;33m❙\033[1;37m◆\033[1;34m❙\033[1;37m◆\033[1;35m❙\033[1;37m◆\033[1;36m❙\033[1;37m◆\033[1;31m❙")
    filee = input(' [+] File : ')
    fileee = open(filee,'r').read()
    cpy(fileee,lim)
    file = open('filer.txt','r').readlines()
    idd.append(file)
    with bsn(max_workers=30) as crack:
        psl('clear')
        logo()
        print('')
        print(' \033[1;97m[+] Total messages : %s' %(len(file)))
        print(' \033[1;97mYour Process Started in Background')
        print ("""\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑◑\033[1;33m◑\033[1;34m◑\033[1;35m◑""")
        for mess in idd:
            sm = '1'
            if sm == '1':
                crack.submit(msg,mess,coki,lnk,delay,hater)
        os.sys.exit()

def msg(mess,coki,lnk,delay,hater):
    ses = requests.Session()
    try:
        for msgs in mess:
            try:
                time.sleep(delay)
                timm = datetime.datetime.now()
                nm,ti = str(timm).split(' ')
                tim,hff = ti.split('.')
                today = datetime.date.today()
                year,month,day = str(today).split('-')
                cookies={'cookie': coki}
                g_url = 'https://d.facebook.com/messages/read/?tid='+lnk
                g_headers = {
                    'authority': 'd.facebook.com',
                    'accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9',
                    'accept-language': 'en-US,en;q=0.9',
                    'cache-control': 'max-age=0',
                    'referer': 'https://d.facebook.com/messages/read/?tid='+lnk,
                    'sec-ch-prefers-color-scheme': 'light',
                    'sec-ch-ua': '" Not A;Brand";v="99", "Chromium";v="101"',
                    'sec-ch-ua-full-version-list': '" Not A;Brand";v="99.0.0.0", "Chromium";v="101.0.4951.40"',
                    'sec-ch-ua-mobile': '?1',
                    'sec-ch-ua-platform': '"Android"',
                    'sec-ch-ua-platform-version': '"11.0.0"',
                    'sec-fetch-dest': 'document',
                    'sec-fetch-mode': 'navigate',
                    'sec-fetch-site': 'same-origin',
                    'sec-fetch-user': '?1',
                    'upgrade-insecure-requests': '1',
                    'user-agent': 'Mozilla/5.0 (Linux; Android 11; TECNO CE7j) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/101.0.4951.40 Mobile Safari/537.36',
                }
                res1 = requests.get(url=g_url, cookies=cookies, headers=g_headers).text
                j2 = re.search(
                    r'name="jazoest" value="([^"]+)"',
                    res1
                ).group(1)
        
                fb_dtsg = re.search(
                    r'name="fb_dtsg" value="([^"]+)"',
                    res1
                ).group(1)
        
                csid = re.search(
                    r'name="csid" value="([^"]+)"',
                    res1
                ).group(1)
        
                tids = re.search(
                    r'name="tids" value="([^"]+)"',
                    res1
                ).group(1)
            
                ses.headers.update({
                    'content-type': 'application/x-www-form-urlencoded',
                })
            
                rose1 = sop(res1, 'html.parser')
                rose = rose1.find('form',method='post')['action']
                payload = {
                    'fb_dtsg': fb_dtsg,
                    'jazoest': j2,
                    'body': hater+' '+str(msgs),
                    'send': 'Send',
                    'tids': tids,
                    'wwwupp': 'C3',
                    'platform_xmd': '',
                    'referrer': '',
                    'ctype': '',
                    'cver': 'legacy',
                    'csid': csid
                }
                host = 'https://d.facebook.com'
                post = ses.post(url=host+rose, data=payload, cookies=cookies).text                
                print(' \x1b[1;97m[+] Time :\x1b[1;92m ' +str(tim))
                print("\033[0;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
                print(' \x1b[1;97m[+] Date :\x1b[1;92m ' +day+'/'+month+'/'+year)
                print("\033[0;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
                print(' \x1b[1;97m[+] Haterz : \x1b[1;92m' +hater)
                print("\033[0;32m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●\033[1;37m๑۩♡۩๑\033[0;95m●▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬●")
                print(' \x1b[1;97m[+] Message :\x1b[1;92m ' +hater+msgs+'\x1b[1;97m')
                print ("""\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑\033[1;30m◑\033[1;31m◑\033[1;32m◑\033[1;33m◑\033[1;34m◑\033[1;35m◑\033[1;36m◑\033[1;37m◑◑\033[1;33m◑\033[1;34m◑\033[1;35m◑""")
            except requests.exceptions.ConnectionError:
                time.sleep(10)
                pass
            except Exception as e:
                pass
        loop+=1
    except requests.exceptions.ConnectionError:
        time.sleep(10)
        pass
    except Exception as e:
        print(e) 
        
   
def cpy(fileee,lim):
    for i in range(lim):
        open('filer.txt','a').write(fileee+'\n')

main()


